unklstewy/espTari/test_apps/network_test/sdkconfig.defaults
# espTari Network Test - SDK Configuration Defaults
# Target: ESP32-P4-NANO

# Target chip
CONFIG_IDF_TARGET="esp32p4"

# Partition table (use espTari's main partition table)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../../partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="../../partitions.csv"

# Flash size (16MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM (32MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=400

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Main task needs extra stack for YAML serialization + logging
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# SPIFFS
CONFIG_SPIFFS_MAX_PARTITIONS=1

# Ethernet (internal EMAC + IP101 PHY)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

# WiFi — disable SoftAP support (STA only)
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Watchdog — generous for network init
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# lwIP — needed for mDNS and networking
CONFIG_LWIP_IPV6=n
